'''
=================================第三方插件=================================
change-case 一款快速修改当前选定内容或当前单词的命名
Chinese (Simplified) (简体中文) Language 简体中文
GitHub Pull requests and Issues 查看和管理GitHub拉取请求和问题
GitHub Theme 主题
GitLens — Git supercharged 最后一次提交的作者、时间、信息
Google Translate 翻译
Image preview 图片预览
indent-rainbow 缩进更直观
koroFileHeader 生成头部注释和函数注释
Live Server 实时查看开发的网页或项目效果
markdownlint 格式检查
Microsoft Edge Tools for VS Code 前端调试
Prettier - Code formatter 前端代码格式化
Tabnine AI Autocomplete 智能代码补全
vscode-icons 图标
SQLTools 数据库管理

==================================第三方库==================================

------------------------------------爬虫------------------------------------
#请求库
requests 提供了方便的 HTTP 请求和响应处理功能，可以方便地访问 Web API 接口
Selenium 提供 Web 应用程序测试的工具

#解析库
bs4 提供了 HTML 和 XML 解析相关的功能，可以方便地从网页中提取出所需的信息

#存储
pymysql MYSQL库

#图像识别
可用超级鹰识别

#框架
Scrapy 功能极其强大，但依赖库也多

------------------------------------数据------------------------------------
#数据处理
NumPy 提供了高性能的数值计算功能，特别是对于数组和矩阵的处理，适合处理统一的数值数组数据
Pandas 提供了高效的数据分析和处理工具，可以方便地处理各种数据格式，专门处理表格和混杂数据

#数据可视化
Matplotlib 提供了数据可视化相关的功能，可以绘制各种图表
pyecharts 相较于Matplotlib，可以绘制更复杂图表

------------------------------------大数据-----------------------------------
PySpark 海量数据大规模分布式计算


-----------------------------------Web开发-----------------------------------
Django 提供了完整的 Web 开发框架，可以方便地搭建高效的 Web 应用程序
Flask 提供了轻量级的 Web 开发框架，可以方便地搭建简单的 Web 应用程序

-----------------------------------GUI开发-----------------------------------
PyQt6 提供了对 Qt 库的 Python 封装，可以方便地开发图形界面应用程序

-----------------------------------游戏开发----------------------------------
Pygame 游戏、多媒体制作，入门级
Panda3D 开源、跨平台的3D渲染和游戏开发

-------------------------------------文件------------------------------------
python-docx 用于创建和更新Word文件
python-pptx 用于创建和更新PPT文件
PyPDF2 用于创建和更新PDF文件

'''
